#+FILETAGS: REFILE

* TODO personalise office
* TODO learn LISP
* TODO Use emacs more, mail, web, news, rss etc.
* TODO read blogs, newsletters etc.
* TODO Plan pumpkin trip
* TODO finish house unpacking
* TODO plan weekly food
* TODO sort out budget
* TODO brick or treat, Legoland
* TODO Remy's halloween costume
* TODO Activities for Kate and Lily
* TODO Develop organisation process, workflow
* TODO Start a math150 project
* TODO Write tutorials on project management, GTD so on for mathematicians, scientists, academics and teachers
* TODO Set up office like in GTD such as trays, clips etc.
* TODO Bitbucket repository for org files
* TODO Set up capture mode
* TODO Set up level 1 headings (with properties)
* TODO Research Pavel Tsatsouline 
* TODO Personalise office
* TODO Research IDO
  CLOCK: [2012-10-12 Fri 14:17]--[2012-10-12 Fri 14:17] =>  0:00
[2012-10-12 Fri 14:17]

* TODO Update exercise schedule
  CLOCK: [2012-10-12 Fri 14:49]--[2012-10-12 Fri 14:49] =>  0:00
[2012-10-12 Fri 14:49]

* TODO Listen to Scott Sonnon
  CLOCK: [2012-10-12 Fri 14:55]--[2012-10-12 Fri 14:55] =>  0:00
[2012-10-12 Fri 14:55]
[[http://physicalliving.com/exclusive-interview-with-johns-coach-scott-sonnon-the-creator-of-the-circular-strength-training-system/][part 1]]
[[http://physicalliving.com/exclusive-interview-with-johns-coach-scott-sonnon-the-creator-of-the-circular-strength-training-system-part-2/][part 2]]
* TODO Research authentic learning
  CLOCK: [2012-10-14 Sun 19:55]--[2012-10-14 Sun 19:55] =>  0:00
[2012-10-14 Sun 19:55]
* TODO Design workflow
what are the structures?
where do things go?
e.g. active projects have next items
someday things are projects/todos without any next?
  CLOCK: [2012-10-14 Sun 19:55]--[2012-10-14 Sun 19:56] =>  0:01
[2012-10-14 Sun 19:55]
* TODO web based X-server, terminal
  CLOCK: [2012-10-14 Sun 19:56]--[2012-10-14 Sun 19:56] =>  0:00
[2012-10-14 Sun 19:56]
* TODO tea pots
  CLOCK: [2012-10-14 Sun 19:56]--[2012-10-14 Sun 19:56] =>  0:00
[2012-10-14 Sun 19:56]
* TODO stationary storage
  CLOCK: [2012-10-14 Sun 19:56]--[2012-10-14 Sun 19:57] =>  0:01
[2012-10-14 Sun 19:56]
* TODO manage paper-based materials
I do have some! Some reference like birth certificates, but also I get forms and things too sometimes
  CLOCK: [2012-10-14 Sun 19:57]--[2012-10-14 Sun 19:57] =>  0:00
[2012-10-14 Sun 19:57]
* TODO Bills to pay list
Need an org heading with due dates
  CLOCK: [2012-10-14 Sun 19:57]--[2012-10-14 Sun 19:58] =>  0:01
[2012-10-14 Sun 19:57]
* TODO Manage my computer settings
I want my computing environment available wherever I am (at least with ssh or a unix system)
See also my web based x-server and terminal
** Version control config files
** Version control scripts, junk code
** RSA keys somewhere portable, maybe use PGP also?

  CLOCK: [2012-10-14 Sun 19:58]--[2012-10-14 Sun 20:00] =>  0:02
[2012-10-14 Sun 19:58]
* TODO Voice notes in android directly into mobile-org
  CLOCK: [2012-10-14 Sun 20:27]--[2012-10-14 Sun 20:27] =>  0:00
[2012-10-14 Sun 20:27]
* TODO Sort Lily's asthma
  CLOCK: [2012-10-14 Sun 20:31]--[2012-10-14 Sun 20:31] =>  0:00
[2012-10-14 Sun 20:31]
* TODO Update social security address
  CLOCK: [2012-10-14 Sun 20:33]--[2012-10-14 Sun 20:33] =>  0:00
[2012-10-14 Sun 20:33]
* TODO Respond to %:from on %:subject
  CLOCK: [2012-10-14 Sun 20:33]--[2012-10-14 Sun 20:33] =>  0:00
[2012-10-14 Sun 20:33]
* TODO Find doctor
[[http://kp.org][KP]]
  CLOCK: [2012-10-14 Sun 20:33]--[2012-10-14 Sun 20:33] =>  0:00
[2012-10-14 Sun 20:33]
* TODO Update training schedule
  CLOCK: [2012-10-14 Sun 20:33]--[2012-10-14 Sun 20:34] =>  0:01
[2012-10-14 Sun 20:33]
* TODO Create contacts in emacs
  CLOCK: [2012-10-14 Sun 20:34]--[2012-10-14 Sun 20:34] =>  0:00
[2012-10-14 Sun 20:34]
* TODO MATH150 Wk 3 lectures
  CLOCK: [2012-10-14 Sun 20:34]--[2012-10-14 Sun 20:34] =>  0:00
[2012-10-14 Sun 20:34]
* TODO org-mode contacts list
If I need to contact someone, make the org link to the contact entry so I can choose phone, email whatever
  CLOCK: [2012-10-14 Sun 20:35]--[2012-10-14 Sun 20:36] =>  0:01
[2012-10-14 Sun 20:35]
* TODO Research IP phones
I want to be able to contact people from within org and perhaps route incoming calls to the computer, say by a virtual number. Then I could answer/make them in org and have capture time it.
  CLOCK: [2012-10-14 Sun 20:36]--[2012-10-14 Sun 20:37] =>  0:01
[2012-10-14 Sun 20:36]
* TODO Contact Lei about seminars
Need a list of people, maybe also at caltech, san fran?
  CLOCK: [2012-10-14 Sun 20:37]--[2012-10-14 Sun 20:38] =>  0:01
[2012-10-14 Sun 20:37]
* TODO Seminars org project
  CLOCK: [2012-10-14 Sun 20:38]--[2012-10-14 Sun 20:38] =>  0:00
[2012-10-14 Sun 20:38]
* TODO Invite Visitors
Some money available through colloquia funds?
  CLOCK: [2012-10-14 Sun 20:39]--[2012-10-14 Sun 20:40] =>  0:01
[2012-10-14 Sun 20:39]
* TODO Research grants
I want mostly travel money 
Can I hire a car so we can all go on a road trip?
I need books
I want to do some sage or org-mode devel
I want to do teaching with sage-tex and/or org-mode with babel; i.e. interactive lectures so I can change the parameters of things like plots in real time
  CLOCK: [2012-10-14 Sun 20:40]--[2012-10-14 Sun 20:41] =>  0:01
[2012-10-14 Sun 20:40]
* TODO Make "errands" context for org-mode
  CLOCK: [2012-10-14 Sun 20:41]--[2012-10-14 Sun 20:42] =>  0:01
[2012-10-14 Sun 20:41]
* TODO Preparing/doing research using org-mode
Write a paper on how to do it? Use my own paper preperation as model
  CLOCK: [2012-10-14 Sun 20:42]--[2012-10-14 Sun 20:43] =>  0:01
[2012-10-14 Sun 20:42]
* TODO Write org-mode teaching paper
Use a course as a guinea pig for using the method
  CLOCK: [2012-10-14 Sun 20:43]--[2012-10-14 Sun 20:44] =>  0:01
[2012-10-14 Sun 20:43]
* TODO Call del-sol office about having a hamster
  CLOCK: [2012-10-14 Sun 20:44]--[2012-10-14 Sun 20:44] =>  0:00
[2012-10-14 Sun 20:44]
* TODO Plan home organisation
places to file things
storage containers
everything has a home!
pantry shelves
  CLOCK: [2012-10-14 Sun 20:44]--[2012-10-14 Sun 20:45] =>  0:01
[2012-10-14 Sun 20:44]
* TODO Sort out Rent
A11078844
  CLOCK: [2012-10-14 Sun 20:48]--[2012-10-14 Sun 20:49] =>  0:01
[2012-10-14 Sun 20:48]
* TODO Research Supervising
Say summer projects, or reading courses
Can I employ (through a grant?) research assistants? These should get something like a paper or conference proceeding out of it

  CLOCK: [2012-10-15 Mon 09:32]--[2012-10-15 Mon 09:33] =>  0:01
[2012-10-15 Mon 09:32]
* TODO Perspective levels
What are my 50000ft to runway goals, principles, priorities etc.
At the runway (i.e. actions) level, I should have a list of procedures for following when doing common tasks e.g. weekly review
  CLOCK: [2012-10-15 Mon 09:33]--[2012-10-15 Mon 09:35] =>  0:02
[2012-10-15 Mon 09:33]
* TODO remote access to ucsd
euclid is old and won't have all the applications I need
can I ssh into my workstation?
  CLOCK: [2012-10-15 Mon 09:35]--[2012-10-15 Mon 09:35] =>  0:00
[2012-10-15 Mon 09:35]
* TODO Respond to %:from on %:subject
  CLOCK: [2012-10-15 Mon 09:35]--[2012-10-15 Mon 09:35] =>  0:00
[2012-10-15 Mon 09:35]
* TODO research bit, bazaar
  CLOCK: [2012-10-15 Mon 09:36]--[2012-10-15 Mon 09:36] =>  0:00
[2012-10-15 Mon 09:36]
* TODO get a cloth or coaster for office
  CLOCK: [2012-10-15 Mon 09:36]--[2012-10-15 Mon 09:36] =>  0:00
[2012-10-15 Mon 09:36]
* TODO set up emacs server and screen for access anywhere
  CLOCK: [2012-10-15 Mon 09:37]--[2012-10-15 Mon 09:38] =>  0:01
[2012-10-15 Mon 09:37]
* TODO Dropbox and vcs
Use dropbox just to mirror static files: can sync between multiple computers
For dynamic files, auto sync to vc every hour or so and sync with dropbox, but to a machine specific folder, e.g. org-office, org-home. These should be seperate directories so I don't get clashes. This is just for backup purposes. The synchronisation should be via bitbucket.
  CLOCK: [2012-10-15 Mon 09:39]--[2012-10-15 Mon 09:41] =>  0:02
[2012-10-15 Mon 09:39]
* TODO Process emails
Archive the lot! Organise into folders/tags whatever. gmail can be the main repository to sync with, but as with org files, maybe have machine specific syncing to dropbox also.
  CLOCK: [2012-10-15 Mon 09:42]--[2012-10-15 Mon 09:43] =>  0:01
[2012-10-15 Mon 09:42]
* TODO Get snacks for office
I should get a plunger and coffee to save money though milk is problematic then! I could bring it daily in a thermos.
I can bring in fruit and veg once or twice a week.
Also could have dry snacks, tinned stuff like sardines and so on.


  CLOCK: [2012-10-15 Mon 09:43]--[2012-10-15 Mon 09:44] =>  0:01
[2012-10-15 Mon 09:43]
* TODO Process for Learning 
If I want to learn something, e.g. some maths or self-improvement, juggling, etc., make a project for this in org-mode where I can store notes. It would be really nice to be able to put a bookmark in a pdf/ebook and create a link in org-mode to that bookmark.
  CLOCK: [2012-10-15 Mon 09:47]--[2012-10-15 Mon 09:50] =>  0:03
[2012-10-15 Mon 09:47]
* TODO podcasts
Find a good postcast player for android. I want to be able to do offline listening and jump to where I was up to last. I want to order them based on say date with oldest first or newest first as the fancy takes me.
  CLOCK: [2012-10-15 Mon 09:50]--[2012-10-15 Mon 09:51] =>  0:01
[2012-10-15 Mon 09:50]
* TODO Update website template
check out http://www.wix.com/
use org-mode to write content, css to render
  CLOCK: [2012-10-15 Mon 10:13]--[2012-10-15 Mon 10:13] =>  0:00
[2012-10-15 Mon 10:13]
* TODO MATH150a mid term
  CLOCK: [2012-10-15 Mon 10:13]--[2012-10-15 Mon 10:13] =>  0:00
[2012-10-15 Mon 10:13]
* TODO Reminder for MATH142B
  CLOCK: [2012-10-15 Mon 10:27]--[2012-10-15 Mon 10:28] =>  0:01
[2012-10-15 Mon 10:27]
* TODO Get Windsor McCay books
  CLOCK: [2012-10-15 Mon 12:10]--[2012-10-15 Mon 12:11] =>  0:01
[2012-10-15 Mon 12:10]
* TODO Extract precise actions/setup from Getting it done and org-mode
[[http://doc.norang.ca/org-mode.html][org-mode article]]
  CLOCK: [2012-10-15 Mon 12:35]--[2012-10-15 Mon 12:36] =>  0:01
[2012-10-15 Mon 12:35]
* TODO MATH150A Lec 3-2
Remark that (i)+(ii)+(iii) allow us to identify differntiable functions on $U$ with those on $V\cap S$

  CLOCK: [2012-10-15 Mon 15:22]--[2012-10-15 Mon 15:23] =>  0:01
[2012-10-15 Mon 15:22]
* TODO Design tea disposal system
bucket like in China?
  CLOCK: [2012-10-15 Mon 15:23]--[2012-10-15 Mon 15:24] =>  0:01
[2012-10-15 Mon 15:23]
* TODO Learn to write lower case and upper case "u" differently
  CLOCK: [2012-10-15 Mon 15:24]--[2012-10-15 Mon 15:24] =>  0:00
[2012-10-15 Mon 15:24]
